Tekla Open API Reference for Tekla Structures 2025
AnalysisLabel.Prefix Property
 The prefix of the analysis label.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Prefix { get; set; }
Public Property Prefix As String
	Get
	Set
Property Value
Type: String
See Also
Reference
AnalysisLabel Class
Tekla.Structures.Analysis Namespace